# 1
# Напишіть код, який зформує строку, яка містить певну інформацію про символ за його номером у слові.
# Наприклад "The [номер символу] symbol in '[тут слово]' is '[символ з відповідним порядковим номером в слові]'".
# Слово та номер символу отримайте за допомогою input() або скористайтеся константою. Наприклад (слово - "Python" а номер символу 3) - "The 3 symbol in 'Python' is 't' ".


val_str = str(input('Напишіть слово :'))
val_num = int(input('Вкажіть порядковий номер символу :'))

print(f'The {val_num} symbol in {val_str} is {val_str[val_num - 1]} ')

#2
# Вести з консолі строку зі слів за допомогою input() (або скористайтеся константою).
# Напишіть код, який визначить кількість слів, в цих даних.

str = input('Напишіть речення :')

count = 1

for find_words in str:
    if find_words == ' ':
        count+=1
        continue

print(f'Текст складається з {count} слів')

#3
#Існує ліст з різними даними,
# наприклад lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum'].
# Напишіть код, який сформує новий list (наприклад lst2), який би містив всі числові змінні (int, float), які є в lst1.
# Майте на увазі, що данні в lst1 не є статичними можуть змінюватись від запуску до запуску.

lst1 = ['1', '2', 3, True, 'False', 5.4, 4, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']
lst2 = []
for number in lst1 :
    if type(number) == int or type(number) == float:
        lst2.append(number)
print(lst2)






