# Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:
#
# Попросіть користувача ввести свсвій вік (можно використати константу або input()).
# - якщо користувачу менше 7 - вивести повідомлення "Де твої батьки?"
# - якщо користувачу менше 16 - вивести повідомлення  "Це фільм для дорослих!"
# - якщо користувачу більше 65 - вивести повідомлення "Покажіть пенсійне посвідчення!"
# - якщо вік користувача з двох однакових цифр - вивести повідомлення  "Як цікаво!"
# - у будь-якому іншому випадку - вивести повідомлення "А білетів вже немає!"
#
# P.S. На екран має бути виведено лише одне повідомлення,
# якщо вік користувача з двох однакових цифр то має бути виведено тільки відповідне повідомлення!
# Також подумайте над варіантами, коли введені невірні або неадекватні дані.


age = int(input('Вкажіть ваш вік! :'))

if age <= 0:
    print('Здається сталась помилка!')
elif age > 120:
    print('Здається сталась помилка!')
elif age < 7:
    print('Де твої батьки?')
elif age % 11 == 0:
    print('Як цікаво!')
elif age < 16:
    print('Це фільм для дорослих!')
elif age > 65:
    print('Покажіть пенсійне посвідчення!')
else:
    print('А білетів вже немає!')

